In [1]:
import pandas as pd

RIDE LENGHT OF EACH MONTH GREATER THAN OR EQUALS TO 0.1

In [131]:
RL1 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_RideLength/RideLenght_Jan_df.csv')

In [132]:
RL1.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff1,Lat1,Ride_Lng1,Status
0,1,4B3238841FB982FD,electric_bike,3240,-0.02,0.12,member
1,2,739FDF9435C1BBA5,electric_bike,1860,0.04,0.11,casual
2,3,3A4D8A0D73FE76C5,electric_bike,1920,0.04,0.11,casual

In [133]:
#number of rows and columns
RL1.shape

(25, 7)

In [134]:
#import dataset
RL2 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_RideLength/RideLength_Feb_df.csv')

In [135]:
#view few rows of the dataset
RL2.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff2,Lat2,Ride_Lng2,Status
0,1,FD108A9603BD8F58,classic_bike,3180,-0.007602,0.139261,member
1,2,79F80E4445B0AE48,electric_bike,3420,-0.066209,0.102705,casual
2,3,EF465651214DAFB4,electric_bike,2460,-0.062417,0.111015,member

In [136]:
RL2.shape

(29, 7)

In [137]:
#import dataset
RL3 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_RideLength/RideLength_Mar_df.csv')

In [138]:
#number of rows and columns
RL3.shape

(7, 7)

In [139]:
#view few rows of the dataset
RL3.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff3,Lat3,Ride_Lng3,Status
0,1,98CD950D1A56A71E,electric_bike,2520,-0.068835,0.112534,member
1,2,57157E8322677857,classic_bike,3420,-0.007602,0.139261,member
2,3,360C19A9D936DDF4,electric_bike,6840,0.023332,0.135774,casual

In [140]:
#import dataset
RL4 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_RideLength/RideLength_Apr_df.csv')

In [141]:
#number of rows and columns
RL4.shape

(56, 7)

In [142]:
#view few rows of the dataset
RL4.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff4,Lat4,Ride_Lng4,Status
0,1,B9C3793C2C203216,electric_bike,2460,-0.020000,0.120000,member
1,2,E24FD2C13EE74170,electric_bike,4140,-0.105680,0.100383,member
2,3,05731F09B881908C,electric_bike,1920,0.007225,0.101891,casual

In [143]:
#import dataset
RL5 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_RideLength/RideLength_May_df.csv')

In [144]:
#number of rows and columns
RL5.shape

(81, 7)

In [145]:
#view few rows of the dataset
RL5.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff5,Lat5,Ride_Lng5,Status
0,1,4FE00E8C8B69B235,classic_bike,5280,-0.103206,0.105881,casual
1,2,0F3910CE7613FA8E,electric_bike,31538580,-0.009211,0.101687,casual
2,3,8291EB95FEAB3762,electric_bike,2940,-0.083455,0.129175,member

In [146]:
#import dataset
RL6 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_RideLength/RideLength_Jun_df.csv')

In [147]:
#number of rows and columns
RL6.shape

(81, 7)

In [148]:
#view few rows of the dataset
RL6.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff6,Lat6,Ride_Lng6,Status
0,1,4FE00E8C8B69B235,classic_bike,5280,-0.103206,0.105881,casual
1,2,0F3910CE7613FA8E,electric_bike,31538580,-0.009211,0.101687,casual
2,3,8291EB95FEAB3762,electric_bike,2940,-0.083455,0.129175,member

In [149]:
#import dataset
RL7 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_RideLength/RideLength_Jul_df.csv')

In [150]:
#number of rows and columns
RL7.shape

(123, 7)

In [151]:
#view few rows of the dataset
RL7.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff7,Lat7,Ride_Lng7,Status
0,1,836001477B70E8A4,electric_bike,2040,0.02,0.10,casual
1,2,253DA2C115B06411,electric_bike,31451460,-0.04,0.10,casual
2,3,814623472D538F8C,electric_bike,2160,0.04,0.11,casual

In [152]:
#import dataset
RL8 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_RideLength/RideLength_Aug_df.csv')

In [153]:
#number of rows and columns
RL8.shape

(191, 6)

In [154]:
#view few rows of the dataset
RL8.head(3)

   Unnamed: 0           Ride_ID  Rideable_Type  Time_Diff8  Ride_Lng8  Status
0           1  470807681F760A3C  electric_bike  -912639300       0.16  casual
1           2  466691BB71A116E9  electric_bike        4260       0.15  casual
2           3  F66FA88E5AB6FA16  electric_bike        3180       0.11  casual

In [155]:
#import dataset
RL9 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_RideLength/RideLength_Sep_df.csv')

In [156]:
#number of rows and columns
RL9.shape

(300, 7)

In [157]:
#view few rows of the dataset
RL9.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff9,Lat9,Ride_Lng9,Status
0,1,CF27A083F1A0571C,docked_bike,7140,-0.206372,0.147011,casual
1,2,CCD9A5D26B20A80E,electric_bike,2700,-0.082163,0.115840,member
2,3,B4EE8797FE5B2EF1,classic_bike,31454340,0.009868,0.116343,casual

In [158]:
#import dataset
RL10 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_RideLength/RideLength_Oct_df.csv')

In [159]:
#number of rows and columns
RL10.shape

(483, 7)

In [160]:
#view few rows of the dataset
RL10.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff10,Lat10,Ride_Lng10,Status
0,1,2DDC27F6FA553D57,electric_bike,11940,-0.07,0.10,member
1,2,FBBD132B844F557F,electric_bike,2460,0.01,0.10,casual
2,3,F06E711ABB3AF9A9,electric_bike,2220,0.02,0.11,casual

In [161]:
#import dataset
RL11 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_RideLength/RideLength_Nov_df.csv')

In [162]:
#number of rows and columns
RL11.shape

(357, 7)

In [163]:
#view few rows of the dataset
RL11.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff11,Lat11,Ride_Lng11,Status
0,1,33592C5281FE8AF0,electric_bike,2760,0.010000,0.160000,casual
1,2,D29706971BC0650E,electric_bike,2580,0.013098,0.152258,casual
2,3,677CD69E7F423F26,electric_bike,2340,-0.040000,0.100000,casual

In [164]:
#import dataset
RL12 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_RideLength/RideLength_Dec_df.csv')

In [165]:
#number of rows and columns
RL12.shape

(432, 7)

In [166]:
#view few rows of the dataset
RL12.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff12,Lat12,Ride_Lng12,Status
0,1,88AF9A07B26AA837,electric_bike,2700,-0.03,0.11,casual
1,2,B587573F0E53AC28,electric_bike,2280,-0.05,0.15,casual
2,3,8D81EF11715FFAC9,electric_bike,4140,0.00,0.10,casual

In [167]:
#MERGE THE RIDE LENGHT OF ALL MONTHS INTO AS ONE YEAR
Ride_Lenght = pd.concat([RL1,RL2,RL3,RL4,RL5,RL6,RL7,RL8,RL9,RL10,RL11,RL12])

In [168]:
Ride_Lenght.shape

(2165, 39)

In [169]:
Ride_Lenght.head()

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff1,Lat1,Ride_Lng1,Status,Time_Diff2,Lat2,Ride_Lng2,...,Ride_Lng9,Time_Diff10,Lat10,Ride_Lng10,Time_Diff11,Lat11,Ride_Lng11,Time_Diff12,Lat12,Ride_Lng12
0,1,4B3238841FB982FD,electric_bike,3240.0,-0.02,0.12,member,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,739FDF9435C1BBA5,electric_bike,1860.0,0.04,0.11,casual,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,3A4D8A0D73FE76C5,electric_bike,1920.0,0.04,0.11,casual,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,F89DD1C2DD3CD93C,electric_bike,1920.0,0.04,0.10,casual,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,012B379BEB322471,electric_bike,2040.0,0.04,0.11,casual,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

MERGE ALL DATAFRAME TO 1 YEAR

In [170]:
#import dataset
Jan = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/2021_Data/Jan_df.csv')

In [171]:
#number of rows and columns
Jan.shape

(131573, 7)

In [172]:
#view few rows of the dataset
Jan .head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff1,Lat1,Ride_Lng1,Status
0,1,70B6A9A437D4C30D,classic_bike,660,-0.01099,-0.01034,member
1,2,158A465D4E74C54A,electric_bike,420,0.02000,0.00000,member
2,3,5262016E0F1F2F9A,electric_bike,420,-0.02000,0.01000,member

In [173]:
#import dataset
Feb = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/2021_Data/Feb_df.csv')

In [174]:
#number of rows and columns
Feb.shape

(96834, 7)

In [175]:
#view few rows of the dataset
Feb.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff2,Lat2,Ride_Lng2,Status
0,1,E19E6F1B8D4C42ED,electric_bike,600,0.010341,0.023257,member
1,2,DC88F20C2C55F27F,electric_bike,240,0.000333,-0.006707,member
2,3,EC45C94683FE3F27,electric_bike,120,0.000313,0.003357,member

In [176]:
#import dataset
Mar = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/2021_Data/Mar_df.csv')

In [177]:
#number of rows and columns
Mar.shape

(49622, 7)

In [178]:
#view few rows of the dataset
Mar.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff3,Lat3,Ride_Lng3,Status
0,1,89E7AA6C29227EFF,classic_bike,420,0.008118,-0.004652,member
1,2,0FEFDE2603568365,classic_bike,1200,-0.006836,0.003505,casual
2,3,E6159D746B2DBB91,electric_bike,540,0.000929,-0.003603,member

In [179]:
#import dataset
Apr = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/2021_Data/Apr_df.csv')

In [180]:
#number of rows and columns
Apr.shape

(214272, 7)

In [181]:
#view few rows of the dataset
Apr.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff4,Lat4,Ride_Lng4,Status
0,1,34E6463B89188D1C,electric_bike,480,0.00,-0.03,member
1,2,F0B55B0D2DD86D3A,electric_bike,1020,-0.01,0.06,member
2,3,77D7653614151D4E,electric_bike,840,-0.01,0.03,member

In [182]:
#import dataset
May = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/2021_Data/May_df.csv')

In [183]:
#number of rows and columns
May.shape

(337230, 7)

In [184]:
#view few rows of the dataset
May.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff5,Lat5,Ride_Lng5,Status
0,1,6C992BD37A98A63F,classic_bike,1860,-0.050702,0.035218,member
1,2,1E0145613A209000,docked_bike,3840,0.000000,0.000000,casual
2,3,E498E15508A80BAD,docked_bike,126226680,0.000000,0.000000,casual

In [185]:
#import dataset
Jun = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/2021_Data/Jun_df.csv')

In [186]:
#number of rows and columns
Jun.shape

(337230, 7)

In [187]:
#view few rows of the dataset
Jun.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff6,Lat6,Ride_Lng6,Status
0,1,6C992BD37A98A63F,classic_bike,1860,-0.050702,0.035218,member
1,2,1E0145613A209000,docked_bike,3840,0.000000,0.000000,casual
2,3,E498E15508A80BAD,docked_bike,126226680,0.000000,0.000000,casual

In [188]:
#import dataset
Jul = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/2021_Data/Jul_df.csv')

In [189]:
#number of rows and columns
Jul.shape

(531633, 7)

In [190]:
#view few rows of the dataset
Jul.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff7,Lat7,Ride_Lng7,Status
0,1,C809ED75D6160B2A,electric_bike,720,0.01,-0.02,casual
1,2,DD59FDCE0ACACAF3,electric_bike,2700,0.09,-0.04,casual
2,3,0AB83CB88C43EFC2,electric_bike,60,0.00,0.00,casual

In [191]:
#import dataset
Aug = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/2021_Data/Aug_df.csv')

In [192]:
#number of rows and columns
Aug.shape

(729595, 6)

In [193]:
#view few rows of the dataset
Aug.head(3)

   Unnamed: 0           Ride_ID  Rideable_Type  Time_Diff8  Ride_Lng8  Status
0           1  99FEC93BA843FB20  electric_bike         180       0.01  member
1           2  06048DCFC8520CAF  electric_bike         360       0.01  member
2           3  9598066F68045DF2  electric_bike         360      -0.01  member

In [194]:
#import dataset
Sep = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/2021_Data/Sep_df.csv')

In [195]:
#number of rows and columns
Sep.shape

(822410, 7)

In [196]:
#view few rows of the dataset
Sep.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff9,Lat9,Ride_Lng9,Status
0,1,0A1B623926EF4E16,docked_bike,2100,-0.015384,0.023796,casual
1,2,B2D5583A5A5E76EE,classic_bike,1140,0.010464,-0.025231,casual
2,3,6F264597DDBF427A,classic_bike,1080,-0.029789,0.000372,member

In [197]:
#import dataset
Oct = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/2021_Data/Oct_df.csv')

In [198]:
#number of rows and columns
Oct.shape

(804352, 7)

In [199]:
#view few rows of the dataset
Oct.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff10,Lat10,Ride_Lng10,Status
0,1,99103BB87CC6C1BB,electric_bike,420,0.00,0.00,member
1,2,EAFCCCFB0A3FC5A1,electric_bike,960,0.00,-0.05,member
2,3,9EF4F46C57AD234D,electric_bike,960,-0.02,0.01,member

In [200]:
#import dataset
Nov = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/2021_Data/Nov_df.csv')

In [201]:
#number of rows and columns
Nov.shape

(519380, 7)

In [202]:
#view few rows of the dataset
Nov.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff11,Lat11,Ride_Lng11,Status
0,1,9A4A8801674A3995,classic_bike,300,0.004528,-0.004081,member
1,2,6310A715D7121C8C,electric_bike,900,-0.037039,0.011167,member
2,3,7EFD1EEF66C09AB3,classic_bike,1200,-0.029366,0.002103,member

In [203]:
#import dataset
Dec = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/2021_Data/Dec_df.csv')

In [204]:
#number of rows and columns
Dec.shape

(631226, 7)

In [205]:
#view few rows of the dataset
Dec.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff12,Lat12,Ride_Lng12,Status
0,1,620BC6107255BF4C,electric_bike,180,-0.000814,-0.008495,member
1,2,4471C70731AB2E45,electric_bike,120,0.000000,0.010000,member
2,3,26CA69D43D15EE14,electric_bike,480,-0.020000,0.020000,member

In [206]:
#MERGE DATAFRAME OF ALL MONTHS INTO AS ONE YEAR
Year_2021 = pd.concat([Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec])

In [207]:
#number of rows and columns
Year_2021.shape

(5205357, 39)

In [208]:
#view few rows of the dataset
Year_2021.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff1,Lat1,Ride_Lng1,Status,Time_Diff2,Lat2,Ride_Lng2,...,Ride_Lng9,Time_Diff10,Lat10,Ride_Lng10,Time_Diff11,Lat11,Ride_Lng11,Time_Diff12,Lat12,Ride_Lng12
0,1,70B6A9A437D4C30D,classic_bike,660.0,-0.01099,-0.01034,member,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,158A465D4E74C54A,electric_bike,420.0,0.02000,0.00000,member,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,5262016E0F1F2F9A,electric_bike,420.0,-0.02000,0.01000,member,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

WORKING ON FILTERERED TIME DIFFERENCE GREATER THAN 400 OF THE EACH MONTHS

In [209]:
#import dataset
TD1 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_TimeDiff/TimeDiff_Jan_df.csv')

In [210]:
#number of rows and columns
TD1.shape

(91704, 7)

In [211]:
#view few rows of the dataset
TD1.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff1,Lat1,Ride_Lng1,Status
0,1,70B6A9A437D4C30D,classic_bike,660,-0.01099,-0.01034,member
1,2,158A465D4E74C54A,electric_bike,420,0.02000,0.00000,member
2,3,5262016E0F1F2F9A,electric_bike,420,-0.02000,0.01000,member

In [212]:
#import dataset
TD2 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_TimeDiff/TimeDiff_Feb_df.csv')

In [213]:
#number of rows and columns
TD2.shape

(65700, 7)

In [214]:
#view few rows of the dataset
TD2.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff2,Lat2,Ride_Lng2,Status
0,1,E19E6F1B8D4C42ED,electric_bike,600,0.010341,0.023257,member
1,2,4FA453A75AE377DB,electric_bike,660,-0.019601,-0.006662,member
2,3,5D8969F88C773979,electric_bike,3180,-0.039591,0.013237,casual

In [215]:
#import dataset
TD3 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_TimeDiff/TimeDiff_Mar_df.csv')

In [216]:
#number of rows and columns
TD3.shape

(37175, 7)

In [217]:
#view few rows of the dataset
TD3.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff3,Lat3,Ride_Lng3,Status
0,1,89E7AA6C29227EFF,classic_bike,420,0.008118,-0.004652,member
1,2,0FEFDE2603568365,classic_bike,1200,-0.006836,0.003505,casual
2,3,E6159D746B2DBB91,electric_bike,540,0.000929,-0.003603,member

In [218]:
#import dataset
TD4 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_TimeDiff/TimeDiff_Apr_df.csv')

In [219]:
#number of rows and columns
TD4.shape

(164553, 7)

In [220]:
#view few rows of the dataset
TD4.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff4,Lat4,Ride_Lng4,Status
0,1,34E6463B89188D1C,electric_bike,480,0.00,-0.03,member
1,2,F0B55B0D2DD86D3A,electric_bike,1020,-0.01,0.06,member
2,3,77D7653614151D4E,electric_bike,840,-0.01,0.03,member

In [221]:
#import dataset
TD5 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_TimeDiff/TimeDiff_May_df.csv')

In [222]:
#number of rows and columns
TD5.shape

(263681, 7)

In [223]:
#view few rows of the dataset
TD5.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff5,Lat5,Ride_Lng5,Status
0,1,6C992BD37A98A63F,classic_bike,1860,-0.050702,0.035218,member
1,2,1E0145613A209000,docked_bike,3840,0.000000,0.000000,casual
2,3,E498E15508A80BAD,docked_bike,126226680,0.000000,0.000000,casual

In [224]:
#import dataset
TD6 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_TimeDiff/TimeDiff_Jun_df.csv')

In [225]:
#number of rows and columns
TD6.shape

(263681, 7)

In [226]:
#view few rows of the dataset
TD6.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff6,Lat6,Ride_Lng6,Status
0,1,6C992BD37A98A63F,classic_bike,1860,-0.050702,0.035218,member
1,2,1E0145613A209000,docked_bike,3840,0.000000,0.000000,casual
2,3,E498E15508A80BAD,docked_bike,126226680,0.000000,0.000000,casual

In [227]:
#import dataset
TD7 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_TimeDiff/TimeDiff_Jul_df.csv')

In [228]:
#number of rows and columns
TD7.shape

(424615, 7)

In [229]:
#view few rows of the dataset
TD7.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff7,Lat7,Ride_Lng7,Status
0,1,C809ED75D6160B2A,electric_bike,720,0.01,-0.02,casual
1,2,DD59FDCE0ACACAF3,electric_bike,2700,0.09,-0.04,casual
2,3,7881AC6D39110C60,electric_bike,960,-0.02,-0.01,casual

In [230]:
#import dataset
TD8 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_TimeDiff/TimeDiff_Aug_df.csv')

In [231]:
#number of rows and columns
TD8.shape

(588314, 6)

In [232]:
#view few rows of the dataset
TD8.head(3)

   Unnamed: 0           Ride_ID  Rideable_Type  Time_Diff8  Ride_Lng8  Status
0           1  B03C0FE48C412214  electric_bike        1500   0.020000  member
1           2  2608805637155AB6  electric_bike         540   0.010000  member
2           3  AF529C946F28ED42  electric_bike         540   0.013698  member

In [233]:
#import dataset
TD9 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_TimeDiff/TimeDiff_Sep_df.csv')

In [234]:
#number of rows and columns
TD9.shape

(660806, 7)

In [235]:
#view few rows of the dataset
TD9.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff9,Lat9,Ride_Lng9,Status
0,1,0A1B623926EF4E16,docked_bike,2100,-0.015384,0.023796,casual
1,2,B2D5583A5A5E76EE,classic_bike,1140,0.010464,-0.025231,casual
2,3,6F264597DDBF427A,classic_bike,1080,-0.029789,0.000372,member

In [236]:
#import dataset
TD10 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_TimeDiff/TimeDiff_Oct_df.csv')

In [237]:
#number of rows and columns
TD10.shape

(637314, 7)

In [238]:
#view few rows of the dataset
TD10.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff10,Lat10,Ride_Lng10,Status
0,1,99103BB87CC6C1BB,electric_bike,420,0.00,0.00,member
1,2,EAFCCCFB0A3FC5A1,electric_bike,960,0.00,-0.05,member
2,3,9EF4F46C57AD234D,electric_bike,960,-0.02,0.01,member

In [239]:
#import dataset
TD11 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_TimeDiff/TimeDiff_Nov_df.csv')

In [240]:
#number of rows and columns
TD11.shape

(400190, 7)

In [241]:
#view few rows of the dataset
TD11.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff11,Lat11,Ride_Lng11,Status
0,1,6310A715D7121C8C,electric_bike,900,-0.037039,0.011167,member
1,2,7EFD1EEF66C09AB3,classic_bike,1200,-0.029366,0.002103,member
2,3,2B4A1E87DE47725F,classic_bike,600,-0.011458,0.008996,member

In [242]:
#import dataset
TD12 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_TimeDiff/TimeDiff_Dec_df.csv')

In [243]:
#number of rows and columns
TD12.shape

(451055, 7)

In [244]:
#view few rows of the dataset
TD12.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff12,Lat12,Ride_Lng12,Status
0,1,26CA69D43D15EE14,electric_bike,480,-0.02,0.02,member
1,2,BB731DE2F2EC51C5,electric_bike,540,0.00,-0.02,member
2,3,7176307BBC097313,electric_bike,840,-0.04,-0.01,member

In [359]:
#MERGE TIME DIFFERENCE OF ALL MONTHS INTO AS ONE YEAR
Time_Difference = pd.concat([TD1,TD2,TD3,TD4,TD5,TD6,TD7,TD8,TD9,TD10,TD11,TD12])

In [360]:
#number of rows and columns
Time_Difference.shape

(4048788, 39)

In [361]:
#view few rows of the dataset
Time_Difference.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff1,Lat1,Ride_Lng1,Status,Time_Diff2,Lat2,Ride_Lng2,...,Ride_Lng9,Time_Diff10,Lat10,Ride_Lng10,Time_Diff11,Lat11,Ride_Lng11,Time_Diff12,Lat12,Ride_Lng12
0,1,70B6A9A437D4C30D,classic_bike,660.0,-0.01099,-0.01034,member,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,158A465D4E74C54A,electric_bike,420.0,0.02000,0.00000,member,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,5262016E0F1F2F9A,electric_bike,420.0,-0.02000,0.01000,member,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

RIDE LENGTH LESS THAN 400 FOR ALL MONTHS

In [248]:
#import dataset
LRL1 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessRideLength/LessRideLength_Jan_df.csv')

In [249]:
#number of rows and columns
LRL1.shape

(131437, 7)

In [250]:
#view few rows of the dataset
LRL1.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff1,Lat1,Ride_Lng1,Status
0,1,70B6A9A437D4C30D,classic_bike,660,-0.01099,-0.01034,member
1,2,158A465D4E74C54A,electric_bike,420,0.02000,0.00000,member
2,3,5262016E0F1F2F9A,electric_bike,420,-0.02000,0.01000,member

In [251]:
#import dataset
LRL2 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessRideLength/LessRideLength_Feb_df.csv')

In [252]:
#number of rows and columns
LRL2.shape

(96702, 7)

In [253]:
#view few rows of the dataset
LRL2.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff2,Lat2,Ride_Lng2,Status
0,1,E19E6F1B8D4C42ED,electric_bike,600,0.010341,0.023257,member
1,2,DC88F20C2C55F27F,electric_bike,240,0.000333,-0.006707,member
2,3,EC45C94683FE3F27,electric_bike,120,0.000313,0.003357,member

In [254]:
#import dataset
LRL3 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessRideLength/LessRideLength_Mar_df.csv')

In [255]:
#number of rows and columns
LRL3.shape

(49401, 7)

In [256]:
#view few rows of the dataset
LRL3.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff3,Lat3,Ride_Lng3,Status
0,1,89E7AA6C29227EFF,classic_bike,420,0.008118,-0.004652,member
1,2,0FEFDE2603568365,classic_bike,1200,-0.006836,0.003505,casual
2,3,E6159D746B2DBB91,electric_bike,540,0.000929,-0.003603,member

In [257]:
#import dataset
LRL4 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessRideLength/LessRideLength_Apr_df.csv')

In [258]:
#number of rows and columns
LRL4.shape

(214051, 7)

In [259]:
#view few rows of the dataset
LRL4.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff4,Lat4,Ride_Lng4,Status
0,1,34E6463B89188D1C,electric_bike,480,0.00,-0.03,member
1,2,F0B55B0D2DD86D3A,electric_bike,1020,-0.01,0.06,member
2,3,77D7653614151D4E,electric_bike,840,-0.01,0.03,member

In [260]:
#import dataset
LRL5 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessRideLength/LessRideLength_May_df.csv')

In [261]:
#number of rows and columns
LRL5.shape

(336882, 7)

In [262]:
#view few rows of the dataset
LRL5.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff5,Lat5,Ride_Lng5,Status
0,1,6C992BD37A98A63F,classic_bike,1860,-0.050702,0.035218,member
1,2,1E0145613A209000,docked_bike,3840,0.000000,0.000000,casual
2,3,E498E15508A80BAD,docked_bike,126226680,0.000000,0.000000,casual

In [263]:
#import dataset
LRL6 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessRideLength/LessRideLength_Jun_df.csv')

In [264]:
#number of rows and columns
LRL6.shape

(336882, 7)

In [265]:
#view few rows of the dataset
LRL6.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff6,Lat6,Ride_Lng6,Status
0,1,6C992BD37A98A63F,classic_bike,1860,-0.050702,0.035218,member
1,2,1E0145613A209000,docked_bike,3840,0.000000,0.000000,casual
2,3,E498E15508A80BAD,docked_bike,126226680,0.000000,0.000000,casual

In [266]:
#import dataset
LRL7 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessRideLength/LessRideLength_Jul_df.csv')

In [267]:
#number of rows and columns
LRL7.shape

(531058, 7)

In [268]:
#view few rows of the dataset
LRL7.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff7,Lat7,Ride_Lng7,Status
0,1,C809ED75D6160B2A,electric_bike,720,0.01,-0.02,casual
1,2,DD59FDCE0ACACAF3,electric_bike,2700,0.09,-0.04,casual
2,3,0AB83CB88C43EFC2,electric_bike,60,0.00,0.00,casual

In [269]:
#import dataset
LRL8 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessRideLength/LessRideLength_Aug_df.csv')

In [270]:
#number of rows and columns
LRL8.shape

(728687, 6)

In [271]:
#view few rows of the dataset
LRL8.head(3)

   Unnamed: 0           Ride_ID  Rideable_Type  Time_Diff8  Ride_Lng8  Status
0           1  99FEC93BA843FB20  electric_bike         180       0.01  member
1           2  06048DCFC8520CAF  electric_bike         360       0.01  member
2           3  9598066F68045DF2  electric_bike         360      -0.01  member

In [272]:
#import dataset
LRL9 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessRideLength/LessRideLength_Sep_df.csv')

In [273]:
#number of rows and columns
LRL9.shape

(821379, 7)

In [274]:
#view few rows of the dataset
LRL9.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff9,Lat9,Ride_Lng9,Status
0,1,0A1B623926EF4E16,docked_bike,2100,-0.015384,0.023796,casual
1,2,B2D5583A5A5E76EE,classic_bike,1140,0.010464,-0.025231,casual
2,3,6F264597DDBF427A,classic_bike,1080,-0.029789,0.000372,member

In [275]:
#import dataset
LRL10 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessRideLength/LessRideLength_Oct_df.csv')

In [276]:
#number of rows and columns
LRL10.shape

(803163, 7)

In [277]:
#view few rows of the dataset
LRL10.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff10,Lat10,Ride_Lng10,Status
0,1,99103BB87CC6C1BB,electric_bike,420,0.00,0.00,member
1,2,EAFCCCFB0A3FC5A1,electric_bike,960,0.00,-0.05,member
2,3,9EF4F46C57AD234D,electric_bike,960,-0.02,0.01,member

In [278]:
#import dataset
LRL11 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessRideLength/LessRideLength_Nov_df.csv')

In [279]:
#number of rows and columns
LRL11.shape

(518557, 7)

In [280]:
#view few rows of the dataset
LRL11.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff11,Lat11,Ride_Lng11,Status
0,1,9A4A8801674A3995,classic_bike,300,0.004528,-0.004081,member
1,2,6310A715D7121C8C,electric_bike,900,-0.037039,0.011167,member
2,3,7EFD1EEF66C09AB3,classic_bike,1200,-0.029366,0.002103,member

In [281]:
#import dataset
LRL12 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessRideLength/LessRideLength_Dec_df.csv')

In [282]:
#number of rows and columns
LRL12.shape

(630310, 7)

In [283]:
#view few rows of the dataset
LRL12.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff12,Lat12,Ride_Lng12,Status
0,1,620BC6107255BF4C,electric_bike,180,-0.000814,-0.008495,member
1,2,4471C70731AB2E45,electric_bike,120,0.000000,0.010000,member
2,3,26CA69D43D15EE14,electric_bike,480,-0.020000,0.020000,member

In [347]:
#MERGE TIME DIFFERENCE OF ALL MONTHS INTO AS ONE YEAR
Less_Ride_Lenght = pd.concat([LRL1,LRL2,LRL3,LRL4,LRL5,LRL6,LRL7,LRL8,LRL9,LRL10,LRL11,LRL12])

In [348]:
#number of rows and columns
Less_Ride_Lenght.shape

(5198509, 39)

In [350]:
#view few rows of the dataset
Less_Ride_Lenght.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff1,Lat1,Ride_Lng1,Status,Time_Diff2,Lat2,Ride_Lng2,...,Ride_Lng9,Time_Diff10,Lat10,Ride_Lng10,Time_Diff11,Lat11,Ride_Lng11,Time_Diff12,Lat12,Ride_Lng12
0,1,70B6A9A437D4C30D,classic_bike,660.0,-0.01099,-0.01034,member,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,158A465D4E74C54A,electric_bike,420.0,0.02000,0.00000,member,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,5262016E0F1F2F9A,electric_bike,420.0,-0.02000,0.01000,member,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

WORKING ON THE TIME DIFFERENCE LESS THAN 400 FOR ALL MONTHS

In [287]:
#import dataset
LT1 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessTimeDiff/LessTimeDiff_Jan_df.csv')

In [288]:
#number of rows and columns
LT1.shape

(39869, 7)

In [289]:
#view few rows of the dataset
LT1.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff1,Lat1,Ride_Lng1,Status
0,1,BE119628E44F871E,electric_bike,360,0.01,0.0,member
1,2,69AF78D57854E110,electric_bike,120,0.00,0.0,member
2,3,05F41F5137B5048E,electric_bike,0,0.00,0.0,member

In [290]:
#import dataset
LT2 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessTimeDiff/LessTimeDiff_Feb_df.csv')

In [291]:
#number of rows and columns
LT2.shape

(31134, 7)

In [292]:
#view few rows of the dataset
LT2.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff2,Lat2,Ride_Lng2,Status
0,1,DC88F20C2C55F27F,electric_bike,240,0.000333,-0.006707,member
1,2,EC45C94683FE3F27,electric_bike,120,0.000313,0.003357,member
2,3,BE5E8EB4E7263A0B,electric_bike,0,0.000326,0.003303,casual

In [293]:
#import dataset
LT3 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessTimeDiff/LessTimeDiff_Mar_df.csv')

In [294]:
#number of rows and columns
LT3.shape

(12447, 7)

In [295]:
#view few rows of the dataset
LT3.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff3,Lat3,Ride_Lng3,Status
0,1,B32D3199F1C2E75B,classic_bike,300,-0.007485,0.001866,member
1,2,BDAA7E3494E8D545,electric_bike,360,0.000922,0.011726,casual
2,3,A772742351171257,classic_bike,60,0.000000,0.000000,casual

In [296]:
#import dataset
LT4 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessTimeDiff/LessTimeDiff_Apr_df.csv')

In [297]:
#number of rows and columns
LT4.shape

(49719, 7)

In [298]:
#view few rows of the dataset
LT4.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff4,Lat4,Ride_Lng4,Status
0,1,D13DFEC4E0E0C49A,classic_bike,60,0.00,0.0,member
1,2,29310BC06D57BD2E,electric_bike,240,-0.01,0.0,member
2,3,F314FD7673D0C9C8,electric_bike,180,0.00,0.0,member

In [304]:
#import dataset
LT5 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessTimeDiff/LessTimeDiff_May_df.csv')

In [305]:
#number of rows and columns
LT5.shape

(73549, 7)

In [306]:
#view few rows of the dataset
LT5.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff5,Lat5,Ride_Lng5,Status
0,1,097E76F3651B1AC1,classic_bike,0,0.0,0.0,casual
1,2,53C38EB01E6FA5C4,classic_bike,60,0.0,0.0,casual
2,3,04218447AAC80BD1,classic_bike,120,0.0,0.0,casual

In [307]:
#import dataset
LT6 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessTimeDiff/LessTimeDiff_Jun_df.csv')

In [308]:
#number of rows and columns
LT6.shape

(73549, 7)

In [309]:
#view few rows of the dataset
LT6.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff6,Lat6,Ride_Lng6,Status
0,1,097E76F3651B1AC1,classic_bike,0,0.0,0.0,casual
1,2,53C38EB01E6FA5C4,classic_bike,60,0.0,0.0,casual
2,3,04218447AAC80BD1,classic_bike,120,0.0,0.0,casual

In [310]:
#import dataset
LT7 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessTimeDiff/LessTimeDiff_Jul_df.csv')

In [311]:
#number of rows and columns
LT7.shape

(107018, 7)

In [312]:
#view few rows of the dataset
LT7.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff7,Lat7,Ride_Lng7,Status
0,1,0AB83CB88C43EFC2,electric_bike,60,0.000000,0.00000,casual
1,2,E3D0CC2FE1359880,electric_bike,180,0.000000,0.00000,casual
2,3,2E8574B3B98F8509,electric_bike,360,0.008868,0.00363,casual

In [313]:
#import dataset
LT8 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessTimeDiff/LessTimeDiff_Aug_df.csv')

In [314]:
#number of rows and columns
LT8.shape

(141281, 6)

In [315]:
#view few rows of the dataset
LT8.head(3)

   Unnamed: 0           Ride_ID  Rideable_Type  Time_Diff8  Ride_Lng8  Status
0           1  99FEC93BA843FB20  electric_bike         180       0.01  member
1           2  06048DCFC8520CAF  electric_bike         360       0.01  member
2           3  9598066F68045DF2  electric_bike         360      -0.01  member

In [316]:
#import dataset
LT9 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessTimeDiff/LessTimeDiff_Sep_df.csv')

In [317]:
#number of rows and columns
LT9.shape

(161604, 7)

In [318]:
#view few rows of the dataset
LT9.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff9,Lat9,Ride_Lng9,Status
0,1,62DC2B32872F9BA8,electric_bike,360,-0.013559,0.008393,casual
1,2,9E5DF66EF8177915,classic_bike,300,-0.005390,0.005363,member
2,3,91C00A02A1B89907,classic_bike,360,-0.005646,-0.009372,member

In [319]:
#import dataset
LT10 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessTimeDiff/LessTimeDiff_Oct_df.csv')

In [320]:
#number of rows and columns
LT10.shape

(167038, 7)

In [321]:
#view few rows of the dataset
LT10.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff10,Lat10,Ride_Lng10,Status
0,1,612F12C94A964F3E,electric_bike,360,0.010000,-0.010000,member
1,2,C67017767EED2251,electric_bike,360,-0.010874,0.019146,member
2,3,ABC4532F2B4983AB,electric_bike,60,0.000000,0.000000,member

In [322]:
#import dataset
LT11 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessTimeDiff/LessTimeDiff_Nov_df.csv')

In [323]:
#number of rows and columns
LT11.shape

(119190, 7)

In [324]:
#view few rows of the dataset
LT11.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff11,Lat11,Ride_Lng11,Status
0,1,9A4A8801674A3995,classic_bike,300,0.004528,-0.004081,member
1,2,27F7E6CF8B6E24EE,classic_bike,180,-0.000373,-0.008840,member
2,3,E0EECCB868B7DA13,classic_bike,300,-0.004848,-0.008161,member

In [325]:
#import dataset
LT12 = pd.read_csv('C:/Users/LILIAN/Desktop/Exported Datasets from R/All_LessTimeDiff/LessTimeDiff_Dec_df.csv')

In [326]:
#number of rows and columns
LT12.shape

(180171, 7)

In [327]:
#view few rows of the dataset
LT12.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff12,Lat12,Ride_Lng12,Status
0,1,620BC6107255BF4C,electric_bike,180,-0.000814,-0.008495,member
1,2,4471C70731AB2E45,electric_bike,120,0.000000,0.010000,member
2,3,362947F0437E1514,electric_bike,120,0.000000,0.000000,member

In [328]:
#MERGE TIME DIFFERENCE OF ALL MONTHS INTO AS ONE YEAR
Less_Time_Diff = pd.concat([LT1,LT2,LT3,LT4,LT5,LT6,LT7,LT8,LT9,LT10,LT11,LT12])

In [329]:
#number of rows and columns
Less_Time_Diff.shape

(1156569, 39)

In [330]:
#view few rows of the dataset
Less_Time_Diff.head(3)

,Unnamed: 0,Ride_ID,Rideable_Type,Time_Diff1,Lat1,Ride_Lng1,Status,Time_Diff2,Lat2,Ride_Lng2,...,Ride_Lng9,Time_Diff10,Lat10,Ride_Lng10,Time_Diff11,Lat11,Ride_Lng11,Time_Diff12,Lat12,Ride_Lng12
0,1,BE119628E44F871E,electric_bike,360.0,0.01,0.0,member,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,69AF78D57854E110,electric_bike,120.0,0.00,0.0,member,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,05F41F5137B5048E,electric_bike,0.0,0.00,0.0,member,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

LT =LESS TIME DIFFERENCE
RL = RIDE LENGTH
TD = TIME DIFFERENCE
LRL = LESS RIDE LENGTH
Year_2021

In [ ]:
#EXPORT DATASETS

In [365]:
Less_Ride_Lenght.to_csv(r'C:/Users/LILIAN/Desktop/Exported Datasets from R/Less_Ride_Lenght.csv')

In [355]:
Year_2021.to_csv(r'C:/Users/LILIAN/Desktop/Exported Datasets from R/Year_2021.csv')

In [356]:
Less_Time_Diff.to_csv(r'C:/Users/LILIAN/Desktop/Exported Datasets from R/Less_Time_Diff.csv')

In [357]:
Ride_Lenght.to_csv(r'C:/Users/LILIAN/Desktop/Exported Datasets from R/Ride_Lenght.csv')

In [364]:
Time_Difference.to_csv(r'C:/Users/LILIAN/Desktop/Exported Datasets from R.csv')